---
kind: method
id: M:Autodesk.Revit.DB.View.HasViewDiscipline
zh: 视图
source: html/ce888de2-045e-ad69-c4ed-fdb66c1fb023.htm
---
# Autodesk.Revit.DB.View.HasViewDiscipline Method

**中文**: 视图

Indicates if the view has a Discipline property

## Syntax (C#)
```csharp
public bool HasViewDiscipline()
```

## Returns
True if the view has a Discipline property